// Выражения и операторы. Преобразование типов.

// Записать в коротком виде:
// let a = a + 5;
// a += 5;
// let b = b * 15;
// b *= 15;
// let c = c - 3;
// c -= 3;
// let d = d % 2;
// d %= 2;
// let k = a + k;
// k += a;
// let l = l * b;
// l *= b;
// let m = m * 3 * k;
// m *= 3 * k;

// Возвести переменную в куб, используя краткую запись.
let variableCube;
variableCube **= 3;
console.log(variableCube);

// Если переменная равна “маленький”, присвоить ей значение “большой”,
//  иначе “маленький”. Сделать тоже самое, используя тернарный оператор.

// Записать условие, используя условный оператор if: если переменная меньше нуля: 
// присвоить ей строку “меньше нуля” если переменная равна нулю: присвоить 1
// если больше нуля: используя краткую запись, умножить переменную на 10 
// Сделать тоже самое, используя тернарный оператор.

// Используя конструктор switch, записать следующее условие:
/*
if (a == 'котик') {
    console.log('котик');
} else if (a == 'собака') {
    console.log('собака');
} else if (a == 'хомячок') {
    console.log('хомячок');
} else {
    console.log('неизвестное науке животное');
}
// Важно: в консоли вы должны увидеть только одно условие из 4х.

// Чему равен x в каждом из примеров, объясните почему:
let x = 0 || 'строка';
let x = 1 && 'строка';
let x = null || 1;
let x = null && 1;
let x = 1 && null;
let x = null || 0 || 1;
let x = null && 0 && 1;
// Чему равен x в каждом из примеров, объясните почему:
let x = 1 + 2 + '3';
let x = 1 + 2 - '1';
let x = '1' + 2 - 1;
let x = true + 1;
let x = +'1' + 2;
let x = null + 2;
let x = undefined + 2;
let x = true + undefined;
*/